app/controllers/api/v1/submissions_controller.rb

INSERT INTO "submissions" ("url", "excerpt", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "www.example.com"], ["excerpt", "An excerpt of text to be checked."], ["created_at", "2020-06-03 17:51:07.224077"], ["updated_at", "2020-06-03 17:51:07.224077"]]
---
	def create
		@submission = Submission.new(submission_params)

		if @submission.save